# Assignment 3 - Assignment
## Topic: Handle Missing Values

### Question 1
Create an employee dataset with missing values.

In [1]:
import pandas as pd
import numpy as np

data = {
    'Emp_ID': [101, 102, 103, 104, 105],
    'Name': ['Aman', 'Riya', 'Kunal', 'Neha', 'Arjun'],
    'Age': [25, np.nan, 30, 28, np.nan],
    'Department': ['HR', 'IT', np.nan, 'Finance', 'IT'],
    'Salary': [50000, 60000, np.nan, 55000, np.nan],
    'Experience': [2, 4, np.nan, 3, 5]
}

df = pd.DataFrame(data)

### Question 2
Display the dataset.

In [2]:
df

   Emp_ID   Name   Age Department   Salary  Experience
0     101   Aman  25.0         HR  50000.0         2.0
1     102   Riya   NaN         IT  60000.0         4.0
2     103  Kunal  30.0        NaN      NaN         NaN
3     104   Neha  28.0    Finance  55000.0         3.0
4     105  Arjun   NaN         IT      NaN         5.0

### Question 3
Identify missing values using isnull().

In [3]:
df.isnull()

   Emp_ID   Name    Age  Department  Salary  Experience
0   False  False  False       False   False       False
1   False  False   True       False   False       False
2   False  False  False        True    True        True
3   False  False  False       False   False       False
4   False  False   True       False    True       False

### Question 4
Count missing values column-wise.

In [4]:
df.isnull().sum()

Emp_ID        0
Name          0
Age           2
Department    1
Salary        2
Experience    1
dtype: int64

### Question 5
Find the percentage of missing values in each column.

In [5]:
(df.isnull().sum() / len(df)) * 100

Emp_ID         0.0
Name           0.0
Age           40.0
Department    20.0
Salary        40.0
Experience    20.0
dtype: float64

### Question 6
Drop rows containing missing values.

In [6]:
df.dropna()

   Emp_ID  Name   Age Department   Salary  Experience
0     101  Aman  25.0         HR  50000.0         2.0
3     104  Neha  28.0    Finance  55000.0         3.0

### Question 7
Drop columns containing missing values.

In [7]:
df.dropna(axis=1)

   Emp_ID   Name
0     101   Aman
1     102   Riya
2     103  Kunal
3     104   Neha
4     105  Arjun

### Question 8
Replace missing numerical values using mean.

In [8]:
df_mean = df.copy()
num_cols = df_mean.select_dtypes(include=np.number).columns
df_mean[num_cols] = df_mean[num_cols].fillna(df_mean[num_cols].mean())
df_mean

   Emp_ID   Name        Age Department   Salary  Experience
0     101   Aman  25.000000         HR  50000.0         2.0
1     102   Riya  27.666667         IT  60000.0         4.0
2     103  Kunal  30.000000        NaN  55000.0         3.5
3     104   Neha  28.000000    Finance  55000.0         3.0
4     105  Arjun  27.666667         IT  55000.0         5.0

### Question 9
Replace missing numerical values using median.

In [9]:
df_median = df.copy()
df_median[num_cols] = df_median[num_cols].fillna(df_median[num_cols].median())
df_median

   Emp_ID   Name   Age Department   Salary  Experience
0     101   Aman  25.0         HR  50000.0         2.0
1     102   Riya  28.0         IT  60000.0         4.0
2     103  Kunal  30.0        NaN  55000.0         3.5
3     104   Neha  28.0    Finance  55000.0         3.0
4     105  Arjun  28.0         IT  55000.0         5.0

### Question 10
Replace missing categorical values using mode.

In [10]:
df_mode = df.copy()

cat_cols = df_mode.select_dtypes(include=['object', 'string']).columns

for col in cat_cols:
    df_mode[col] = df_mode[col].fillna(df_mode[col].mode()[0])

df_mode

   Emp_ID   Name   Age Department   Salary  Experience
0     101   Aman  25.0         HR  50000.0         2.0
1     102   Riya   NaN         IT  60000.0         4.0
2     103  Kunal  30.0         IT      NaN         NaN
3     104   Neha  28.0    Finance  55000.0         3.0
4     105  Arjun   NaN         IT      NaN         5.0